##########################################################
#		αρχείο tr.asm

#		αντικαθιστά όλους τους χαρακτήρες 'e' μιας
#		συμβολοσειράς σε 'E'
##########################################################
#
#		χρήση καταχωρητών
#
#		$t0 - περιέχει κάθε φορά ένα χαρακτήρα της
#			συμβολοσειράς
#		$t1 - περιέχει το χαρακτήρα 'Ε'
#		$t2 - περιέχει κάθε φορά τη διεύθυνση ενός χαρακτήρα
#			της συμβολοσειράς
#
##########################################################
#
#		τμήμα κειμένου
#
##########################################################

	.text
	.globl main
main:
	la $t2,chararray	# $t2 = διεύθυνση του πρώτου χαρακτήρα της συμβολοσειράς
	li $t1,69		# φόρτωσε το χαρακτήρα 'E' στον $t1

nextCh: 	lb $t0,($t2)	# φόρτωσε ένα χαρακτήρα της συμβολοσειράς στον $t0
	beqz $t0,strEnd	# αν ο χαρακτήρας είναι ο '\0' goto strEnd

	bne $t0,101,not_e	# αν ο χαρακτήρας δεν είναι ο 'e' goto not_e
	sb $t1,($t2)	# αντικατάστησε τον 'e' με το χαρακτήρα 'E'

not_e:	add $t2,$t2,1	# $t2 = διεύθυνση του επόμενου χαρακτήρα της συμβολοσειράς
	j nextCh		# πήγαινε στη θέση nextCh

strEnd:	la $a0,chararray	# εμφάνισε τη συμβολοσειρά
	li $v0,4
	syscall
	li $v0,10		# να επιστρέψεις στο
	syscall		# λειτουργικό σύστημα

##########################################################
#
#		τμήμα δεδομένων
#
##########################################################

		.data
chararray:
		.asciiz "abeebbaeeeaeeebbebaebabab\n"

##########################################################
#
#		τέλος του αρχείου tr.asm
#
##########################################################


